# Инструкция для работы с Markdown

## Заголовок

Заголовки могут быть разных уровней. Для того, чтобы создать заголовок, необходимо перед текстом поставить знак #. Размер заголовка изменяется путем добавления знака #.
Например, 
# Заголовок или 
## Заголовок

## Выделение текста

Чтобы выделить текст курсивом, необходимо обрамить его звездочками (*) или знаком нижнего подчеркивания (_). Например, *так* или _так_.
Чтобы выделить текст полужирным, необходимо обрамить его двойными звездочками (**) или двойным знаком нижнего подчеркивания (__).
Например, **так** или __так__.
Альтернативные способы выделения жирным или курсивом нужны для того, чтобы мы могли совмещать оба этих способа.
Например, *вот так __вот__*.

## Списки

Чтобы добавить ненумерованные списки, необходимо пункты выделить такими знаками, как *, +, -.
Например:
* элемент1
+ элемент2
- элемент3
Чтобы добавить нумерованные списки, необходимо пункты просто пронумеровать:
1. Элемент1
2. Элемент2

## Работа с изображениями

Чтобы вставить изображение в текст, достаточно написать следующее:
![Привет, это Юля!](Юля11.jpeg)

## Ссылки

Ссылки можно добавить двумя способами, но мы приведем один из них.
Чтобы добавить гиперссылку, достаточно написать:
[Пример](https://istina.msu.ru/profile/Julia_Babykina/)

## Заключение

## Работа с удаленными репозиториями

Существует множество сервисов для работы у удаленными репозиториями. Эта работа позволяет выполнять проект совместными усилиями, вовлекая большое количество людей удаленно.
Для начала необходимо "подружить" сервис (GitHub) с программой (Git):
1. Пройти регистрацию на сервисе.
2. Прописать команды в программе для загрузки локального репозитория в интернет.
Теперь коллеги смогут копировать ссылку на Ваш репозиторий, производить изменения и высылать свои предложения Вам, при этом создавая новую ветку для этих изменений.